/* jslint todo: true */
/* jslint xxx: true */
/* jshint -W100 */
(function(){
  angular
    .module('pluf')
    .service('$process',[
      process
    ]);

  /**
   * @memberof pluf
   * @ngdoc service
   * @name $process
   * @description
   * روی سرور دسته‌ای از پردازش‌ها در حال اجرا است. این سرویس تمام پردازش‌هایی
   * که سمت سرور ایجاد شده است را مدیریت می‌کند. این مدیریت تنها شامل فهرست کردن یا
   * کنترل کردن حالت یک پردازش است.
   *
   * این مدیریت قادر به ایجاد یک پردازش نیست بلکه تنها آنها را فهرست می‌کند. این پردازش‌ها معمولا
   * در ازای یک فراخوانی در سیستم ایجاد می‌شوند.
   *
   */
  function process() {

    /**
     * فهرست تمام پردازش‌هایی که روی سرور هست را تعیین می‌کند. این پردازش‌ها بر اساس سطح
     * دسترسی در اختیار کاربران قرار خواهد گرفت.
     *
     * @memberof $process
     * @return {promis(PaginatedPage(PProcess))} صفحه‌ای از پردازش‌ها
     */
    this.processes = function(){};
    /**
     * اطلاعات یک پردازش را در اختیار کابران قرار می‌دهد. تمام پردازش‌هایی که با این روش بازیابی
     * شوند توسط این سرویس ردیابی و مدیریت می‌شوند.
     *
     * @memberof $process
     * @param  {Number} id شناسه پردازش مورد نظر
     * @return {promis(PProcess)}    یک دستگیره که پردازش مورد نظر را بازیابی می‌کند.
     */
    this.process = function(id){};
  }
})();
