/*
 * این پرونده ابزارهای اصلی برای مدیریت سیستم را ایجاد می‌کند. این ابزارها شامل مدیریت کاربران
 * مدیریت منابع و .. است.
 */
(function() {
  'use strict';

  /**
   * @ngdoc module
   * @name pluf.admin
   * @description
   * این ماژول تمام ابزارهای مدریتی را برای قسمت‌های متفاوت سیستم ایجاد کرده است که شامل
   * مدیریت کاربران و .. است. هر مدیریت به صورت یک سرویس در این ماژول پیاده سازی شده
   * که می‌تواند در پروژه‌ها به صورت مستقیم استفاده شود. این مدریت‌ها معمولا توسعه‌ای از مدیریت‌های
   * معمولی در هسته هستند.
   */
  angular.module('pluf.admin', ['pluf'])

  /**
 	 * @memberof pluf.admin
 	 * @ngdoc service
 	 * @name $auser
 	 *
 	 * @description
   * مدیریت کاربران این سرویس تنها ابزارهایی را که برای مدیریت عادی یک کاربر
   * مورد نیاز است ارائه می‌کند. برای نمونه ورود به سیستم، خروج و یا به روز کردن
   * تنظیم‌های کاربری. مدیریت کاربران در سطح سیستم در سرویس‌های دیگر ارائه
   * می‌شود.
   */
  .service('$auser', function() {
    //XXX: maso, 1395: مدیرت کاربران کل سیستم پیاده سازی شود.
  });
}());
